Revit 2027 API
RebarContainerParameterManager.SetOverriddenParameterReadonly Method
 Sets this overridden parameter to be readonly.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetOverriddenParameterReadonly(
	ElementId paramId
)
Public Sub SetOverriddenParameterReadonly (
	paramId As ElementId
)
public:
void SetOverriddenParameterReadonly(
	ElementId^ paramId
)
member SetOverriddenParameterReadonly :
        paramId : ElementId -> unit
Parameters
paramId ElementId
 Overridden parameter id
Exceptions
Exception | Condition
ArgumentException |  paramId has no override
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace